{
  "backend/main.mo": "Main Motoko actor implementing horse management system with CRUD operations for horses, injuries, feeding events, medicine dosages, and care activities, including blob storage integration and migration support.",
  "backend/migration.mo": "Migration module defining old and new type schemas for converting Text-based IDs to Nat-based IDs across all data structures, with a run function that returns empty new data structures.",
  "feature_evidence.json": "Feature evidence report documenting implementation of care activity tracking functionality across frontend components (CareForm, CareList), hooks (useQueries, useActivityTimeline), and pages (HorseDetailPage).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing React components, hooks, pages, and configuration with emphasis on bigint ID handling and care activity integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining equestrian-themed color variables for light and dark modes using CSS custom properties.",
  "frontend/index.html": "HTML entry point for the React application titled 'Noble Steeds' with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for horses list, horse detail, and activity timeline pages wrapped in Layout component.",
  "frontend/src/components/ActivityTimeline.tsx": "Timeline component that uses useActivityTimeline hook to display filtered activities with loading and empty states, supporting optional horse ID filtering.",
  "frontend/src/components/ActivityTimelineItem.tsx": "Individual activity card component rendering type-specific icons (AlertCircle, Apple, Pill, Heart), badges, timestamps, and descriptions for injury, feeding, medicine, and care activities.",
  "frontend/src/components/CareForm.tsx": "Form component for logging care activities for a horse, with input for care type and submission handling using the useLogCareActivity mutation hook.",
  "frontend/src/components/CareList.tsx": "Displays a list of care activities for a specific horse, fetching data with useCareActivities hook and showing each activity with timestamp and care type.",
  "frontend/src/components/CareSectionForm.tsx": "Empty file with no content.",
  "frontend/src/components/CareSectionList.tsx": "Empty file with no content.",
  "frontend/src/components/FeedingForm.tsx": "Form component for logging feeding events with feed type and amount inputs, submitting data via useLogFeedingEvent mutation hook.",
  "frontend/src/components/FeedingList.tsx": "Displays a list of feeding events for a horse, showing feed type, amount, and timestamp for each event fetched via useGetHorseFeedingEvents hook.",
  "frontend/src/components/HorseCard.tsx": "Card component displaying horse information with avatar, name, and delete functionality via alert dialog; clicking navigates to horse detail page.",
  "frontend/src/components/HorseForm.tsx": "Form for adding a new horse with name input and optional profile photo upload, handling image preview and submission via useAddHorse mutation.",
  "frontend/src/components/HorseList.tsx": "Displays a grid of all horses using HorseCard components, fetching data with useGetAllHorses hook and showing loading/empty states.",
  "frontend/src/components/InjuryForm.tsx": "Form component for logging horse injuries with a textarea for description and submission via useLogInjury mutation hook.",
  "frontend/src/components/InjuryList.tsx": "Displays a list of injuries for a specific horse, showing description and timestamp for each injury fetched via useGetHorseInjuries hook.",
  "frontend/src/components/Layout.tsx": "Main application layout with header navigation (desktop and mobile), logo, footer with caffeine.ai attribution, and outlet for nested routes.",
  "frontend/src/components/MedicineDosageForm.tsx": "Form component for recording medicine dosages with fields for medicine name, dosage amount, and unit selection (mg, g, ml, cc, tablets). Submits data via useRecordMedicineDosage mutation and resets form on success.",
  "frontend/src/components/MedicineDosageList.tsx": "Displays a list of medicine dosages for a specific horse, showing medicine name, dosage amount with unit, and timestamp. Shows loading state or empty state when no dosages exist.",
  "frontend/src/hooks/useActivityTimeline.ts": "Custom hook that aggregates activities (injuries, feeding, medicine, care) across multiple horses into a unified timeline. Fetches data for up to 5 horses using separate query hooks and combines them into a sorted activity list.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates and refetches all dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality and identity state management. Creates AuthClient with configurable options and manages authentication lifecycle including identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including horses, injuries, feeding events, medicine dosages, and care activities. Provides both query hooks for fetching data and mutation hooks for creating/updating/deleting records.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining an earthy, equestrian-inspired color palette for both light and dark modes. Includes browns, tans, and forest greens as primary colors.",
  "frontend/src/lib/utils.ts": "Utility functions including cn() for merging Tailwind classes and formatTimestamp() for converting nanosecond timestamps to human-readable relative time strings (e.g., '2 hours ago').",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/pages/ActivityTimelinePage.tsx": "Displays a filterable chronological timeline of all activities (injuries, feeding, medicine, care) across horses with a dropdown to filter by specific horse or view all.",
  "frontend/src/pages/HorseDetailPage.tsx": "Shows detailed horse profile with avatar and tabbed interface for managing injuries, feeding, medicine dosages, and care activities specific to that horse.",
  "frontend/src/pages/HorsesPage.tsx": "Main horses listing page with header and dialog-based form to add new horses, displaying all horses in a list component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, extended theme with equestrian-inspired design tokens, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking implemented features including multi-horse management, injury logs, feed tracking, medicine dosages, care sections, activity timeline, and equestrian-themed UI design."
}